<?xml version="1.0" ?>
<net name="ppn24" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data element_type="f32" shape="40000,10"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40000</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx_initializer_node_ln1.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="32,10" size="1280"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="10/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="0" transpose_b="1"/>
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="onnx_initializer_node_ln1.bias/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1280" shape="1,32" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="10" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="11" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="onnx_initializer_node_ln2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="1408" shape="32,32" size="4096"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="12/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="0" transpose_b="1"/>
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="onnx_initializer_node_ln2.bias/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5504" shape="1,32" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="12" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="13" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="onnx_initializer_node_ln3.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="5632" shape="32,32" size="4096"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="14/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="0" transpose_b="1"/>
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="onnx_initializer_node_ln3.bias/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="9728" shape="1,32" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="14" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="15" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx_initializer_node_ln3a.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="9856" shape="32,32" size="4096"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="16/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="0" transpose_b="1"/>
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="onnx_initializer_node_ln3a.bias/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="13952" shape="1,32" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="16" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="17" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="19/1_port_transpose474_const" type="Const" version="opset1">
			<data element_type="f32" offset="14080" shape="3,32" size="384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="19" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>3</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>40000</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="20" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40000</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="20/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>40000</dim>
					<dim>3</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2020.1.0-61-gd349c3ba4a"/>
		<cli_parameters>
			<batch value="40000"/>
			<blobs_as_inputs value="True"/>
			<data_type value="float"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input_model value="DIR\ppn24.onnx"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="ppn24"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="disable_fusing, disable_gfusing, finegrain_fusing, input, input_shape, output, placeholder_shapes, scale, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
